; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v5 ?v12)
             (pred_5 ?v13 ?v1)
             (pred_6 ?v5 ?v1)
             (pred_12 ?v7 ?v5 )
	     (pred_7 ?v5)
             (pred_3 ?v3)
             (pred_11 ?v13)
             (pred_8 ?v1)
             (pred_4 ?v5)
             (pred_2 ?v13)
             (pred_10 ?v5)
             (pred_1 ))



(:action op_4
:parameters (?v11 ?v9 ?v4 ?v8)
:precondition (and (pred_3 ?v11) (pred_3 ?v9) (pred_11 ?v4) (pred_8 ?v8)
          (pred_9 ?v11 ?v9) (pred_5 ?v4 ?v8)
                   (pred_6 ?v9 ?v8) (pred_7 ?v11) 
                   (pred_4 ?v9) (pred_2 ?v4))
:effect (and  (pred_10 ?v9) (not (pred_4 ?v9))))


(:action op_1
:parameters (?v11 ?v10)
:precondition (and (pred_3 ?v11) (pred_3 ?v10)
               (pred_7 ?v11) (pred_9 ?v11 ?v10) (pred_10 ?v10))
:effect (and (pred_7 ?v10) (not (pred_7 ?v11))))

(:action op_3
:parameters (?v11 ?v4)
:precondition (and (pred_3 ?v11) (pred_11 ?v4) 
                  (pred_7 ?v11) (pred_12 ?v4 ?v11) (pred_1 ))
:effect (and (pred_2 ?v4)
   (not (pred_12 ?v4 ?v11)) (not (pred_1 ))))


(:action op_5
:parameters (?v11 ?v6 ?v2)
:precondition (and (pred_3 ?v11) (pred_11 ?v6) (pred_11 ?v2)
                  (pred_7 ?v11) (pred_2 ?v2) (pred_12 ?v6 ?v11))
:effect (and (pred_2 ?v6) (pred_12 ?v2 ?v11)
        (not (pred_2 ?v2)) (not (pred_12 ?v6 ?v11))))

(:action op_2
:parameters (?v11 ?v4)
:precondition (and (pred_3 ?v11) (pred_11 ?v4) 
                  (pred_7 ?v11) (pred_2 ?v4))
:effect (and (pred_1 ) (pred_12 ?v4 ?v11) (not (pred_2 ?v4)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_05 obj_29 obj_28 obj_01 obj_07 obj_21 obj_18 obj_04 obj_26 obj_13 obj_19 obj_22 obj_23 obj_25 obj_10 obj_12 obj_06 obj_17 obj_30 obj_16 obj_02 obj_09 obj_11 obj_14
    obj_15 obj_27
    obj_24 obj_03 obj_20
    )

    (:init
       (pred_1)

       (pred_3 obj_08)
       (pred_3 obj_05)
       (pred_3 obj_29)
       (pred_3 obj_28)
       (pred_3 obj_01)
       (pred_3 obj_07)
       (pred_3 obj_21)
       (pred_3 obj_18)
       (pred_3 obj_04)
       (pred_3 obj_26)
       (pred_3 obj_13)
       (pred_3 obj_19)
       (pred_3 obj_22)
       (pred_3 obj_23)
       (pred_3 obj_25)
       (pred_3 obj_10)
       (pred_3 obj_12)
       (pred_3 obj_06)
       (pred_3 obj_17)
       (pred_3 obj_30)
       (pred_3 obj_16)
       (pred_3 obj_02)
       (pred_3 obj_09)
       (pred_3 obj_11)
       (pred_3 obj_14)
       (pred_8 obj_15)
       (pred_8 obj_27)
       (pred_11 obj_24)
       (pred_11 obj_03)
       (pred_11 obj_20)

       (pred_9 obj_08 obj_07)
       (pred_9 obj_08 obj_05)
       (pred_9 obj_05 obj_21)
       (pred_9 obj_05 obj_29)
       (pred_9 obj_05 obj_08)
       (pred_9 obj_29 obj_18)
       (pred_9 obj_29 obj_28)
       (pred_9 obj_29 obj_05)
       (pred_9 obj_28 obj_04)
       (pred_9 obj_28 obj_01)
       (pred_9 obj_28 obj_29)
       (pred_9 obj_01 obj_26)
       (pred_9 obj_01 obj_28)
       (pred_9 obj_07 obj_13)
       (pred_9 obj_07 obj_21)
       (pred_9 obj_07 obj_08)
       (pred_9 obj_21 obj_19)
       (pred_9 obj_21 obj_18)
       (pred_9 obj_21 obj_05)
       (pred_9 obj_21 obj_07)
       (pred_9 obj_18 obj_22)
       (pred_9 obj_18 obj_04)
       (pred_9 obj_18 obj_29)
       (pred_9 obj_18 obj_21)
       (pred_9 obj_04 obj_23)
       (pred_9 obj_04 obj_26)
       (pred_9 obj_04 obj_28)
       (pred_9 obj_04 obj_18)
       (pred_9 obj_26 obj_25)
       (pred_9 obj_26 obj_01)
       (pred_9 obj_26 obj_04)
       (pred_9 obj_13 obj_10)
       (pred_9 obj_13 obj_19)
       (pred_9 obj_13 obj_07)
       (pred_9 obj_19 obj_12)
       (pred_9 obj_19 obj_22)
       (pred_9 obj_19 obj_21)
       (pred_9 obj_19 obj_13)
       (pred_9 obj_22 obj_06)
       (pred_9 obj_22 obj_23)
       (pred_9 obj_22 obj_18)
       (pred_9 obj_22 obj_19)
       (pred_9 obj_23 obj_17)
       (pred_9 obj_23 obj_25)
       (pred_9 obj_23 obj_04)
       (pred_9 obj_23 obj_22)
       (pred_9 obj_25 obj_30)
       (pred_9 obj_25 obj_26)
       (pred_9 obj_25 obj_23)
       (pred_9 obj_10 obj_16)
       (pred_9 obj_10 obj_12)
       (pred_9 obj_10 obj_13)
       (pred_9 obj_12 obj_02)
       (pred_9 obj_12 obj_06)
       (pred_9 obj_12 obj_19)
       (pred_9 obj_12 obj_10)
       (pred_9 obj_06 obj_09)
       (pred_9 obj_06 obj_17)
       (pred_9 obj_06 obj_22)
       (pred_9 obj_06 obj_12)
       (pred_9 obj_17 obj_11)
       (pred_9 obj_17 obj_30)
       (pred_9 obj_17 obj_23)
       (pred_9 obj_17 obj_06)
       (pred_9 obj_30 obj_14)
       (pred_9 obj_30 obj_25)
       (pred_9 obj_30 obj_17)
       (pred_9 obj_16 obj_02)
       (pred_9 obj_16 obj_10)
       (pred_9 obj_02 obj_09)
       (pred_9 obj_02 obj_12)
       (pred_9 obj_02 obj_16)
       (pred_9 obj_09 obj_11)
       (pred_9 obj_09 obj_06)
       (pred_9 obj_09 obj_02)
       (pred_9 obj_11 obj_14)
       (pred_9 obj_11 obj_17)
       (pred_9 obj_11 obj_09)
       (pred_9 obj_14 obj_30)
       (pred_9 obj_14 obj_11)
       (pred_4 obj_07)
       (pred_4 obj_16)
       (pred_4 obj_19)
       (pred_6  obj_07 obj_15)
       (pred_6  obj_16 obj_27)
       (pred_6  obj_19 obj_27)
       (pred_10 obj_08)
       (pred_10 obj_05)
       (pred_10 obj_29)
       (pred_10 obj_28)
       (pred_10 obj_01)
       (pred_10 obj_21)
       (pred_10 obj_18)
       (pred_10 obj_04)
       (pred_10 obj_26)
       (pred_10 obj_13)
       (pred_10 obj_22)
       (pred_10 obj_23)
       (pred_10 obj_25)
       (pred_10 obj_10)
       (pred_10 obj_12)
       (pred_10 obj_06)
       (pred_10 obj_17)
       (pred_10 obj_30)
       (pred_10 obj_02)
       (pred_10 obj_09)
       (pred_10 obj_11)
       (pred_10 obj_14)

       (pred_5  obj_24 obj_15)
       (pred_5  obj_03 obj_27)
       (pred_5  obj_20 obj_15)
       (pred_12 obj_24 obj_06)
       (pred_12 obj_03 obj_02)
       (pred_12 obj_20 obj_04)
       (pred_7 obj_05)
    )

    (:goal (and
       (pred_12 obj_24 obj_18)
       (pred_12 obj_20 obj_08)
    ))
(:constraints
  (always (not (pred_7 obj_22)))
)
)

; plan
1. (op_1 obj_05 obj_21)
   deleted: (pred_7 obj_05)
   added: (pred_7 obj_21)
   goals met: 0 of 2
2. (op_1 obj_21 obj_18)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_18)
   goals met: 0 of 2
3. (op_1 obj_18 obj_04)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_04)
   goals met: 0 of 2
4. (op_3 obj_04 obj_20)
   deleted: (pred_12 obj_20 obj_04) (pred_1)
   added: (pred_2 obj_20)
   goals met: 0 of 2
5. (op_1 obj_04 obj_18)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_18)
   goals met: 0 of 2
6. (op_1 obj_18 obj_29)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_29)
   goals met: 0 of 2
7. (op_1 obj_29 obj_05)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_05)
   goals met: 0 of 2
8. (op_1 obj_05 obj_08)
   deleted: (pred_7 obj_05)
   added: (pred_7 obj_08)
   goals met: 0 of 2
9. (op_2 obj_08 obj_20)
   deleted: (pred_2 obj_20)
   added: (pred_1) (pred_12 obj_20 obj_08)
   goals met: 1 of 2
10. (op_1 obj_08 obj_05)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_05)
   goals met: 1 of 2
11. (op_1 obj_05 obj_29)
   deleted: (pred_7 obj_05)
   added: (pred_7 obj_29)
   goals met: 1 of 2
12. (op_1 obj_29 obj_18)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_18)
   goals met: 1 of 2
13. (op_1 obj_18 obj_04)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_04)
   goals met: 1 of 2
14. (op_1 obj_04 obj_23)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_23)
   goals met: 1 of 2
15. (op_1 obj_23 obj_17)
   deleted: (pred_7 obj_23)
   added: (pred_7 obj_17)
   goals met: 1 of 2
16. (op_1 obj_17 obj_06)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_06)
   goals met: 1 of 2
17. (op_3 obj_06 obj_24)
   deleted: (pred_12 obj_24 obj_06) (pred_1)
   added: (pred_2 obj_24)
   goals met: 1 of 2
18. (op_1 obj_06 obj_17)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_17)
   goals met: 1 of 2
19. (op_1 obj_17 obj_23)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_23)
   goals met: 1 of 2
20. (op_1 obj_23 obj_04)
   deleted: (pred_7 obj_23)
   added: (pred_7 obj_04)
   goals met: 1 of 2
21. (op_1 obj_04 obj_18)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_18)
   goals met: 1 of 2
22. (op_2 obj_18 obj_24)
   deleted: (pred_2 obj_24)
   added: (pred_1) (pred_12 obj_24 obj_18)
   goals met: 2 of 2
